import React from 'react';
import './PlaceInput.scss';


class PlaceInput extends React.Component {
    constructor(props) {
      super(props);
      this.state = {
        json: [
            {
                id: 1,
            "adress":"проїзд 40 років ДАІ, 3, м. Кременчук, 39600",
            "oblast":"м. Кременчук",
            "nazva":"Управління патрульної поліції у м. Кременчук"
            },
            
            {
                id: 2,
            "adress":"вул. Фрунзе, 164, м. Полтава, 36008",
            "oblast":"Полтавська область",
            "nazva":"Управління патрульної поліції у м. Полтава"
            },
            
            {
                id: 3,
            "adress":"вул. Залізнична, 15, м. Луцьк, 43021",
            "oblast":"Волинська область",
            "nazva":"Управління патрульної поліції у м. Луцьк"
            },
            
            {
                id: 4,
            "adress":"вул. Степана Бандери, 14 а, м. Рівне, 33028",
            "oblast":"Рівненська область",
            "nazva":"Управління патрульної поліції у м. Рівне"
            },
            
            {
                id: 5,
            "adress":"вул. Покровська, 96, м. Житомир, 10003",
            "oblast":"Житомирська область",
            "nazva":"Управління патрульної поліції у м. Житомир"
            },
            
            {
                id: 6,
            "adress":"вул. Народного Ополчення, 9, м. Київ, 03680",
            "oblast":"Київ та Київська область",
            "nazva":"Управління патрульної поліції у м. Київ"
            },
            
            {
                id: 7,
            "adress":"вул. Громадська (Борисенко), 66, м. Чернігів, 14037",
            "oblast":"Чернігівська область",
            "nazva":"Управління патрульної поліції у м. Чернігів"
            },
            
            {
                id: 8,
            "adress":"вул. Білопольский шлях, 18/1, м. Суми, 40009",
            "oblast":"Сумська область",
            "nazva":"Управління патрульної поліції у м. Суми"
            },
            
            {
                id: 9,
            "adress":"вул. Перфецького, 19, м. Львів, 79000",
            "oblast":"Львівська область",
            "nazva":"Управління патрульної поліції у м. Львів"
            },
            
            {
                id: 10,
            "adress":"вул. Котляревського, 24, м. Тернопіль, 46003",
            "oblast":"Тернопільська область",
            "nazva":"Управління патрульної поліції у м. Тернопіль"
            },
            
            {
                id: 11,
            "adress":"пер. Коцюбинського, 35/2, м. Хмельницький, 29008",
            "oblast":"Хмельницька область",
            "nazva":"Управління патрульної поліції у м. Хмельницький"
            },
            
            {
                id: 12,
            "adress":"вул. Ботанічна, 24, м. Вінниця, 21010",
            "oblast":"Вінницька область",
            "nazva":"Управління патрульної поліції у м. Вінниця"
            },
            
            {
                id: 13,
            "adress":"вул. Лесі Українки, 21, м. Черкаси, 18002",
            "oblast":"Черкаська область",
            "nazva":"Управління патрульної поліції у м. Черкаси"
            },
            
            {
                id: 14,
            "adress":"вул. Шевченко, 315а, м. Харків, 61033",
            "oblast":"Харківська область",
            "nazva":"Управління патрульної поліції у м. Харків"
            },
            
            {
                id: 15,
            "adress":"вул. Штейгерська, 8, м. Лисичанськ, 93100",
            "oblast":"Луганська область",
            "nazva":"Управління патрульної поліції у м. Лисичанськ"
            },
            
            {
                id: 16,
            "adress":"пл. Троїцька, 2а, м. Дніпро, 49000",
            "oblast":"Дніпропетровська область",
            "nazva":"Управління патрульної поліції у м. Дніпро"
            },
            
            {
                id: 17,
            "adress":"вул. Заводська, 22, м. Чернівці, 58000",
            "oblast":"Чернівецька область",
            "nazva":"Управління патрульної поліції у м. Чернівці"
            },
            
            {
                id: 18,
            "adress":"вул. Юності, 15, м. Івано-Франківськ, 76023",
            "oblast":"Івано-Франківська область",
            "nazva":"Управління патрульної поліції у м. Івано-Франківськ"
            },
            
            {
                id: 19,
            "adress":"вул. Кошевого, 2, м. Ужгород, 85006",
            "oblast":"Закарпатська область",
            "nazva":"Управління патрульної поліції у мм. Ужгороді та Мукачево"
            },
            
            {
                id: 20,
            "adress":"вул. Академіка Корольова, 5, м. Одеса, 65114",
            "oblast":"Одеська область",
            "nazva":"Управління патрульної поліції у м. Одеса"
            },
            
            {
                id: 21,
            "adress":"вул. Новозаводська, 1б, м. Миколаїв, 54056",
            "oblast":"Миколаївська область",
            "nazva":"Управління патрульної поліції у м. Миколаїв"
            },
            
            {
                id: 22,
            "adress":"пр-т Синявина, 128, м. Херсон, 73034",
            "oblast":"Херсонська область",
            "nazva":"Управління патрульної поліції у м. Херсон"
            },
            
            {
                id: 23,
            "adress":"вул. Перемоги, 96, м. Запорожжя, 69057",
            "oblast":"Запорізька область",
            "nazva":"Управління патрульної поліції у м. Запорожжя"
            }  
        ]  
      }
    }
    handleChange = (event) => {
        let newObj = this.state.json.find((el) => el.oblast === event.target.value);
        console.log(newObj);
        this.props.onChange(newObj, 5);
    }
    render() {
      return (
        <>
            <select onChange={this.handleChange}>                          
                    {
                        this.state.json.map(el => {
                            if(el.id === 6) return <option key ={el.id} value={el.oblast} selected disabled hidden>{el.oblast}</option>
                            return <option key={el.id} value={el.oblast}>{el.oblast}</option>
                        })
                    }
            </select>
        </>
      );
    }
  }
  
export default PlaceInput;