import React from "react";
import "./Offer.scss";

class Offer extends React.Component {
    constructor(props) {
        super(props);
        this.state = {
            show: false,
            showHelp: false,
            name: "",
            tel: "",
        };
    }
    render() {
        return (
            <div className="Offer">
                <h2>ПУБЛІЧНА ОФЕРТА</h2>
                <h4>
                    Договору про використання сервісу <br />
                    <a href="https://avtoshtraf.com">
                        {" "}
                        https://avtoshtraf.com{" "}
                    </a>
                </h4>
                <p className="italic">
                    Вітаємо! <br /> Ми розробили Сервіс, який дозволить
                    оскаржити штраф за перевищення швидкості руху. В даному
                    договорі ви знайдете умови, на яких надається даний Сервіс,
                    зможете дізнатися його вартість, інформацію про виконавця
                    тощо.
                </p>
                <p>
                    Ми розробили даний договір максимально простим та зрозумілим
                    для Вас, але якщо у Вас виникнуть додаткові питання –
                    напишіть нам на електронну пошту _______@_______.
                </p>
                <ul>
                    <li>
                        <p className="underlined">
                            <b>СТОРОНИ ДОГОВОРУ</b>
                        </p>
                        <ul>
                            <li>
                                <b> ВИКОНАВЕЦЬ:</b> ТОВ «____________», код
                                ЄДРПОУ: __________,
                            </li>
                            <li>
                                <b> ЗАМОВНИК:</b> будь-яка фізична особа, яка
                                бажає використати Сервіс.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>СТОРОНИ ДОГОВОРУ</b>
                        </p>
                        <ul>
                            <li>
                                <b>
                                    Договір про використання сервісу (Договір)
                                </b>{" "}
                                – умови, на яких Замовник може скористатися
                                Сервісом та отримати Послугу.
                            </li>
                            <li>
                                <b>Публічна оферта договору</b> – пропозиція
                                Виконавця, адресована будь-якій фізичній особі,
                                у відповідності зі статтею 633 Цивільного
                                кодексу України, ч. 2 ст. 642 Цивільного кодексу
                                України, прийняти умови Договору про
                                використання сервісу та скористатися Сервісом.
                            </li>
                            <li>
                                <b>Акцепт</b> – повна й безумовна згода
                                Замовника з пропозицією (Публічною офертою
                                договору) Виконавця на умовах викладених нижче.
                            </li>
                            <li>
                                <b>Сервіс</b> – результат комп’ютерного
                                програмування у вигляді інтернет-сайту та
                                онлайн-сервісу
                                <a href="https://avtoshtraf.com">
                                    {" "}
                                    https://avtoshtraf.com
                                </a>{" "}
                                , який дозволяє автоматично згенерувати позов до
                                суду та отримати визначену Договором Послугу.
                            </li>
                            <li>
                                <b>Використання сервісу</b> – будь-яка дія,
                                зроблена Замовником на вебсайті
                                <a href="https://avtoshtraf.com">
                                    {" "}
                                    https://avtoshtraf.com
                                </a>{" "}
                                Сервісу.
                            </li>
                            <li>
                                <b>Послуга </b>–використання Сервісу Замовником,
                                шляхом введення необхідної інформації, в
                                результаті чого Сервіс автоматично складає:
                                <ul>
                                    <li>
                                        адміністративний позову для оскарження
                                        штрафу за перевищення швидкості руху та
                                        надає його Замовнику на умовах даного
                                        Договору.
                                    </li>
                                </ul>
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ЗАГАЛЬНІ ПОЛОЖЕННЯ</b>
                        </p>
                        <ul>
                            <li>
                                <b>Предмет договору.</b> Виконавець надає
                                Замовнику Послугу, а Замовник зобов’язується її
                                оплатити на умовах даного Договору.
                            </li>
                            <li>
                                <b>Укладання Договору.</b>
                                <ul>
                                    <li>
                                        <span className="underlined">
                                            {" "}
                                            Пропозиція укласти Договір (Публічна
                                            оферта).
                                        </span>{" "}
                                        Виконавець розміщує на вебсайті
                                        <a href="https://avtoshtraf.com">
                                            {" "}
                                            https://avtoshtraf.com
                                        </a>{" "}
                                        дану Публічну оферту договору та
                                        пропонує не обмеженій кількості
                                        Замовнику прийняти дану Публічну оферту
                                        договору та використати Сервіс та
                                        отримати Послугу.
                                    </li>
                                    <li>
                                        <span className="underlined">
                                            {" "}
                                            Прийняття пропозиції Виконавця
                                            (Акцепт).
                                        </span>{" "}
                                        Замовник приймає умови даного Договору
                                        повністю та надає безумовну з Публічною
                                        офертою договору Виконавця, шляхом
                                        вчинення однієї з наступних дій або
                                        обидві:
                                        <ul>
                                            <li>Використовуючи Сервіс;</li>
                                            <li>Здійснюючи оплату Послуг.</li>
                                        </ul>
                                    </li>
                                    <li>
                                        <span className="underlined">
                                            {" "}
                                            Укладання Договору.
                                        </span>{" "}
                                        Договір про використання Сервісу
                                        вважається укладеним після прийняття
                                        (акцепту) пропозиції Виконавця
                                        (Публічної оферти) Замовником.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                <b>Наслідки укладання Договору.</b> Укладаючи
                                Договір Замовник підтверджує факт ознайомлення
                                та згоди з усіма умовами Договору про
                                використання сервісу в повному обсязі та
                                зобов’язується їх виконувати.
                            </li>
                            <li>
                                <b>Не згода з умовами даного Договору.</b> Якщо
                                Замовник не згодний з умовами Договору він
                                зобов’язаний негайно припинити використання
                                Сервісу та відмовитися від отримання Послуг за
                                Договором.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ПОРЯДОК НАДАННЯ ПОСЛУГ</b>
                        </p>
                        <ul>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Для отримання Послуги Замовник
                                    зобов’язується:
                                </span>{" "}
                                <ul>
                                    <li>
                                        надати Виконавцю необхідну інформацію
                                        для складання адміністративного позову,
                                        шляхом заповнення полів у Сервісі;
                                    </li>
                                    <li>оплатити Послуги.</li>
                                </ul>
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Достовірність введених даних.
                                </span>{" "}
                                Замовник самостійно несе усю відповідальність за
                                введені ним дані у Сервісі та несе
                                відповідальність, що дані є достовірними.
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Оброблення введених даних.
                                </span>{" "}
                                Оброблення введених Замовником даних
                                здійснюється у відповідності до політики
                                конфіденційності, розміщеної за посиланням:
                                <a href="https://avtoshtraf.com/offer">
                                    {" "}
                                    https://avtoshtraf.com/offer
                                </a>{" "}
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Надання Послуг:
                                </span>{" "}
                                <ul>
                                    <li>
                                        Після введення усіх даних у Сервісі та
                                        здійснення оплати Послуг, Виконавець
                                        надає Замовнику, а Замовник приймає
                                        автоматично згенерований Сервісом
                                        адміністративний позов, на підставі
                                        даних внесених Замовником у Сервісі.
                                    </li>
                                    <li>
                                        Послуга вважається наданою Виконавцем та
                                        прийнятою Замовником після автоматичної
                                        генерації адміністративного позову у
                                        Сервісі та надання позову для скачування
                                        Замовнику або відправлення згенерованого
                                        адміністративного позову на електронну
                                        пошту, зазначену Замовником.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                У розуміння п. 26-1підрозділу 2 розділу XX
                                Податкового кодексу використання Сервісу та
                                надання Послуг є операцією з постачання
                                програмної продукції.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ВАРТІСТЬ ПОСЛУГ, ПОРЯДОК І ТЕРМІНИ ОПЛАТИ</b>
                        </p>
                        <ul>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Вартість Послуг складає:
                                </span>{" "}
                                <ul>
                                    <li>
                                        За підготовку адміністративного позову
                                        для оскарження штрафу за перевищення
                                        швидкості руху – 50,00 (п’ятдесят
                                        гривень 00 копійок) без ПДВ.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Зміна вартості Послуг.
                                </span>{" "}
                                Виконавець залишає за собою право змінювати
                                встановлену Вартість Послуг у разі змінення
                                ринкових умов або за інших суттєвих обставин.
                                Інформація про ці зміни відображається у
                                Сервісі.
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Оплата Послуг
                                </span>{" "}
                                здійснюється виключно на умовах передплати,
                                шляхом перерахування 100% вартості Послуг, за
                                допомогою захищеного з’єднання платіжної
                                системи, на банківський рахунок Виконавця.
                                Виконавець не має жодного доступу до платіжних
                                даних Замовника.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>УМОВИ ПОВЕРНЕННЯ КОШТІВ</b>
                        </p>
                        <ul>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Повернення коштів можливе виключно у
                                    наступних випадках:
                                </span>{" "}
                                <ul>
                                    <li>
                                        Адміністративний позов не було
                                        автоматично згенеровано у Сервісі або не
                                        було відправлено протягом однієї доби на
                                        електронну адресу Замовника вказану під
                                        час заповнення відповідної форми Сайту.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                Для того щоб повернути кошти, Замовник має
                                звернутися до Виконавця на електронну пошту
                                ________________ та надати наступні документи:
                                <ul>
                                    <li>
                                        заява про неналежне надання Послуг зі
                                        сторони Виконавця, з описом обставин які
                                        склалися та доказів;
                                    </li>
                                    <li>
                                        документ, що підтверджує особу (паспорт
                                        та ідентифікаційний код) Замовника;
                                    </li>
                                    <li>
                                        квитанція, що підтверджує оплату Послуг
                                        Виконавцю.
                                    </li>
                                </ul>
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ВІДМОВА ВІД ГАРАНТІЙ: </b>
                        </p>
                        <ul>
                            <li>
                                Цей Сервіс надається Виконавцем на основі «як
                                є», Виконавець не несе відповідальності, якщо з
                                будь-якої причини вся або будь-яка частина
                                Сервісу недоступна в будь-який час або протягом
                                будь-якого періоду, в тому числі у разі збоїв
                                технічних сервісів на яких побудований Сервіс та
                                сервісів, де він розміщений. Виконавець не несе
                                відповідальності у разі прийняття рішення суду
                                не на користь Замовника.
                            </li>
                            <li>
                                 Виконавець не несе відповідальності:
                                <ul>
                                    <li>
                                        за подальші дії, які необхідно виконати
                                        Замовнику;
                                    </li>
                                    <li>
                                        за подачу Замовником адміністративного
                                        позову до відповідного суду.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                Послуга може бути не актуальною у випадку сплати
                                Замовником штрафу.
                            </li>
                            <li>
                                Виконавець не несе будь-яку відповідальність за
                                ненадання або неналежне надання Послуг Замовнику
                                за умови настання будь-яких обставин, які
                                виникли не з вини Виконавця (а саме – настання
                                обставин, які виникли з вини чи необережності
                                Замовника та / або настання обставин, які
                                виникли з вини чи необережності будь-якої
                                третьої особи (будь-яких третіх осіб) та /або
                                настання форс-мажорних обставин).
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ЗАСТОСОВАНЕ ПРАВО</b>
                        </p>
                        <ul>
                            <li>
                                Цей Договір регулюється і тлумачяться відповідно
                                до законодавства України.   
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ПОРУШЕННЯ УМОВ ДОГОВОРУ ЗАМОВНИКОМ</b>
                        </p>
                        <ul>
                            <li>
                                У разі порушення Замовником положень цього
                                Договору, Виконавець може негайно призупинити
                                використання Сервісу Замовником та призупинити
                                надання Послуг.
                            </li>
                            <li>
                                Виконавець та Замовник намагатимуться домовитись
                                про мирне врегулювання спору у зв’язку з
                                порушенням Замовником положень цього Договору.
                            </li>
                            <li>
                                Якщо в результаті порушення Замовником умов
                                Договору Виконавцю буде завдано збитків, то
                                Виконавець може вимагати справедливого
                                відшкодування.  
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>
                                ТЕРМІН ДІЇ ДОГОВОРУ, ПОРЯДОК ЙОГО ЗМІНИ ТА
                                РОЗІРВАННЯ
                            </b>
                        </p>
                        <ul>
                            <li>
                                Договір набирає чинність з моменту його Акцепту
                                Замовником та діє протягом строку використання
                                Сервісу Замовником та надання Послуг Виконавцем
                                Замовнику.
                            </li>
                            <li>
                                В односторонньому порядку Договір може бути
                                розірваний за ініціативи Виконавця, шляхом
                                повідомлення про це Замовника.
                            </li>
                            <li>
                                Замовник може припинити даний Договір, шляхом
                                припинення використання Сервісу. 
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ІНШІ УМОВИ ДОГОВОРУ</b>
                        </p>
                        <ul>
                            <li>
                                Кожна Сторона гарантує іншій Стороні, що володіє
                                необхідною дієздатністю, а рівно всіма правами і
                                повноваженнями, необхідними і достатніми для
                                укладання і виконання цього Договору відповідно
                                до його умов.
                            </li>
                            <li>
                                Виконавець може змінювати умови цього Договору,
                                а також ціни на Послуги, в односторонньому
                                порядку, розміщуючи їх у Сервісі. Всі зміни
                                набувають чинності з моменту їх публікації.
                            </li>
                        </ul>
                    </li>
                </ul>

                {/* <p>
                    Документ, положення якого викладені нижче по тексту, є
                    публічною офертою та публічним договором. Згідно із
                    положеннями ст.ст. 633, 641 Цивільного кодексу України умови
                    публічної оферти та публічного договору є однаковими для
                    всіх користувачів (Замовників) -{" "}
                    <a href="https://avtoshtraf.com">
                        {" "}
                        https://avtoshtraf.com{" "}
                    </a>
                    (надалі по тексту - «Сайт»). У відповідності до ч. 2 ст. 642
                    Цивільного кодексу України, оплата послуг на Сайті є
                    акцептом даної оферти, що прирівнюється до укладення
                    договору на умовах викладених нижче по тексту.
                </p>
                <p>
                    Дана публічна оферта адресована всім фізичним особам, що
                    бажають скористатися послугою і мають технічну можливість
                    одержання послуги.
                </p>
                <h5>1. ТЕРМІНИ ТА ВИЗНАЧЕННЯ</h5>
                <p>
                    1.1. Публічна оферта – пропозиція Виконавця, адресована
                    будь-якій фізичній особі особам, у відповідності зі статтею
                    633 Цивільного кодексу України, укласти з ним публічний
                    договір про надання послуг доступу до сервісу Сайту для
                    автоматичної генерацій адміністративного позову для
                    оскарження штрафу за перевищення швидкості руху.
                </p>
                <p>
                    1.2. Акцепт – повна й безумовна згода Замовника на укладення
                    даного Договору на умовах викладених нижче.
                </p>
                <p>
                    1.3. Виконавець – ТОВ «2х2 Фінанс», код ЕГРПОУ: 38618785 є
                    власником Сайту та сервісу Сайту та надає послуги визначені
                    даним Договором.
                </p>
                <p>
                    1.4. Замовник – фізична особа, користувач сервісу, яка
                    внесла відповідні запитувані дані на Сайті та оплатила
                    послугу.
                </p>
                <p>
                    1.5. Послуга – це автоматична генерація адміністративного
                    позову за допомогою сервісу Сайту після здійснення оплати
                    вартості послуги та на підставі внесених Замовником на Сайті
                    даних. Послуга є оплатною.
                </p>
                <p>
                    1.6. Вартість Послуги – вартість Послуги встановлюється
                    відповідно до Додатку 1 до цього Договору.
                </p>
                <h5>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h5>
                <p>
                    2.1. На підставі та на умовах визначених цим Договором після
                    здійснення оплати за послугу Виконавець надає Замовнику, а
                    Замовник приймає автоматично згенерований Сайтом
                    адміністративний позов на підставі даних внесених Замовником
                    на Сайті.
                </p>
                <p>
                    2.2. Послуга надається на платній основі. Вартість послуги
                    встановлюється Додатком 1 до цього Договору.
                </p>
                <p>
                    2.3. Послуга вважається наданою після автоматичної генерації
                    адміністративного позову на Сайті або відправлення
                    згенерованого адміністративного позову на електронну адресу
                    зазначену Замовником у відповідному розділі Сайту.
                </p>
                <p>
                    2.4. Всі зміни й доповнення до даного Договору
                    опубліковуються на сайті Виконавця.
                </p>
                <p>
                    2.5. Всі умови даного Договору є обов'язковими як для
                    Замовника, так і для Виконавця. Перед початком користування
                    Послугою Замовник зобов'язаний ознайомитися з умовами даного
                    Договору. Якщо Замовник не згодний з умовами даного
                    Договору, він не вправі користуватися послугами.
                </p>
                <p>
                    2.6. У разі незгоди Замовника зі змінами, внесеними
                    Виконавцем у даний Договір або з новими тарифами на Послугу
                    Замовник повинен припинити користування сервісом.
                </p>
                <p>
                    2.7. Виконавець не несе відповідальності:
                    <ul>
                        <li>
                            за подальші дії, які необхідно виконати Замовнику;
                        </li>
                        <li>
                            за подачу Замовником адміністративного позову до
                            відповідного суду;
                        </li>
                        <li>
                            за постановлення ухвали не на користь Замовника.
                        </li>
                    </ul>
                </p>
                <p>
                    2.8. Послуга Сайту може бути не актуальною у випадку сплати
                    Замовником штрафу.
                </p>
                <h5>3. ПОРЯДОК НАДАННЯ ПОСЛУГ</h5>
                <p>
                    3.1. Надання послуг починається після прийняття Замовником
                    умов даного Договору, без його письмового підписання
                    Сторонами. Дійсний Договір має юридичну силу відповідно до
                    ст. 633 ЦК України і є рівносильним Договору, підписаному
                    Сторонами. Відповідно, Замовник, який ознайомився на сайті
                    вважається ознайомленим з даним Договором та таким, що
                    погоджується з усіма його умовами.
                </p>
                <p>
                    3.2. Послуги за даним Договором надаються Замовнику на
                    платній основі.
                </p>
                <h5>4. ПРАВА ТА ОБОВЯЗКИ СТОРІН</h5>
                <p>4.1. Виконавець зобов'язується:</p>
                <p>
                    4.1.1. Надавати Замовнику послуги відповідно до сплаченого
                    об’єму послуг.
                </p>
                <br />
                <p>4.2. Замовник зобов'язується:</p>
                <p>
                    4.2.1. При користуванні послугами вчасно оплачувати послуги
                    Виконавця в обсязі, порядку і терміни передбачені даним
                    Договором.
                </p>
                <p>
                    4.2.2. Бути уважними під час заповнення даних необхідних для
                    формування позову.
                </p>
                <p>4.2.3. Дотримуватися умов даного Договору.</p>
                <p>
                    4.2.4. Не перепродавати та не передавати результати Послуги
                    за даним Договором третім особам.
                </p>
                <p>
                    4.2.5. Ознайомитись з Договором, дотримуватись та виконувати
                    його вимоги.
                </p>
                <br />
                <p>4.3. Замовник має право:</p>
                <p>4.3.1. Отримувати інформацію про послуги, тарифи.</p>
                <h5>5. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h5>
                <p>
                    5.1. За невиконання або неналежне виконання зобов'язань за
                    даним Договором Сторони несуть відповідальність згідно з
                    даним Договором та чинним законодавством України.
                </p>
                <p>
                    5.2. Виконавець не несе відповідальності у разі
                    постановлення ухвали суду не на користь Замовника.
                </p>
                <p>
                    5.3. Сервіс Сайту не зберігає інформацію про банківські
                    реквізити Замовника, а отже Виконавець не несе
                    відповідальності за їх розповсюдження.
                </p>
                <h5>6. ВАРТІСТЬ ПОСЛУГ, ПОРЯДОК І ТЕРМІНИ ОПЛАТИ</h5>
                <p>
                    6.1. Замовник здійснює оплату Послуги за тарифами, які
                    встановлюються Виконавцем в Додатку 1 до даного Договору.
                    Виконавець залишає за собою право змінювати встановлені
                    тарифи у разі змінення ринкових умов або за інших суттєвих
                    обставин.
                </p>
                <p>
                    6.2. Оплата послуг здійснюється на умовах передплати. В разі
                    не здійснення оплати - Послуга Сайтом надана не буде.
                </p>
                <p>
                    6.3. Оплата послуг здійснюється Замовником на сервісі Сайту
                    у відповідному розділі шляхом перерахування коштів на
                    банківський рахунок Виконавця.
                </p>
                <h5>7. УМОВИ ПОВЕРНЕННЯ КОШТІВ</h5>
                <p>
                    7.1. Замовник має право вимагати повернення коштів від
                    Виконавця виключно у наступних випадках:
                </p>
                <p>
                    7.1.1. Адміністративний позов не було автоматично
                    згенеровано на сайті Виконавця{" "}
                    <a href="https://avtoshtraf.com">
                        {" "}
                        https://avtoshtraf.com{" "}
                    </a>{" "}
                    або не було відправлено протягом однієї доби на електронну
                    адресу Замовника вказану під час заповнення відповідної
                    форми сайту.
                </p>
                <p>
                    7.2. За для повернення коштів, Замовник має звернутися до
                    офісу ТОВ «2х2 Фінанс» та надати наступні документи:
                    <ul>
                        <li>
                            документ, що підтверджує особу (паспорт та
                            ідентифікаційний код) Замовника;
                        </li>
                        <li>
                            письмова заява про неналежне надання Послуг зі
                            сторони Виконавця із обов’язковим наданням
                            відповідних доказів;
                        </li>
                        <li>
                            квитанція, що підтверджує оплату послуг Виконавцю.
                        </li>
                    </ul>
                </p>
                <p>
                    7.3. Всі витрати, пов’язані з поверненням коштів несе
                    Замовник.
                </p>
                <h5>8. ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ</h5>
                <p>
                    8.1 Сторони звільняються від відповідальності за невиконання
                    або неналежне виконання своїх зобов’язань у випадку, якщо
                    таке невиконання або неналежне виконання сталося унаслідок
                    дії обставин непереборної сили. Під обставинами непереборної
                    сили розуміються пожежі, землетруси, інші природні явища,
                    стихійні лиха, дії третіх осіб, збої в електропостачанні й у
                    роботі комунікацій, які використовуються для надання послуг,
                    прийняття актів державних органів та інші незалежні від
                    Сторін обставини, що унеможливлюють своєчасне, повне та
                    належне виконання Стороною своїх зобов’язань за даним
                    Договором.
                </p>
                <h5>
                    9. ТЕРМІН ДІЇ ДОГОВОРУ, ПОРЯДОК ЙОГО ЗМІНИ ТА РОЗІРВАННЯ
                </h5>
                <p>
                    9.1. Даний Договір набирає чинність для Сторін з моменту
                    оплати Замовником на Сайті, вважається укладеним на
                    невизначений строк.
                </p>
                <p>
                    9.2. В односторонньому порядку Договір може бути розірваний
                    лише за ініціативи Виконавця.
                </p>
                <p>
                    9.3. Кошти, сплачені Виконавцю за Послугу не повертаються і
                    не компенсуються.
                </p>
                <h6>
                    Додаток 1
                    <br />
                    до Публічної оферти та публічного договору
                    <br />
                    щодо надання послуг доступу до сервісу{" "}
                    <a href="https://avtoshtraf.com">
                        {" "}
                        https://avtoshtraf.com{" "}
                    </a>
                </h6>
                <p>
                    На виконання умов публічного договору щодо надання послуг
                    доступу до сервісу сайту
                    <a href="https://avtoshtraf.com">
                        {" "}
                        https://avtoshtraf.com{" "}
                    </a>{" "}
                    встановлюються наступні тарифи:
                </p>
                <br />
                <p>
                    1. Послуга - автоматична генерація Сайтом адміністративного
                    позову для оскарження штрафу за перевищення швидкості руху{" "}
                    <a href="https://avtoshtraf.com">
                        {" "}
                        https://avtoshtraf.com{" "}
                    </a>
                    .
                </p>
                <p>
                    2. Вартість Послуги становить - 50 грн без ПДВ. Оплата
                    здійснюється в гривнях шляхом безготівкового переказу через
                    автоматизовану систему Liqpay.
                </p>
                <br />
                <br />
                <br />*/}
            </div>
        );
    }
}

export default Offer;
