import React from 'react';
import './Offer.scss';

class Offer extends React.Component{
    constructor(props){
        super(props);
        this.state = {
            show: false,
            showHelp: false,
            name: "",
            tel: ""
        };
    };
    render(){
        return (
            <div className="Offer"> 
                <h4>Публічна оферта та публічний договір щодо надання послуг доступу</h4>
                <p>
                Документ, положення якого викладені нижче по тексту, є публічною офертою та публічним договором. 
                Згідно із положеннями ст.ст. 633, 641 Цивільного кодексу України умови публічної оферти та публічного договору є однаковими 
                для всіх користувачів (Замовників). У відповідності до ч. 2 ст. 642 Цивільного кодексу України, реєстрація на  
                <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a> є акцептом даної оферти, що прирівнюється до укладення договору на умовах викладених нижче по тексту.
                </p>
                <p>
                    Дана публічна оферта адресована всім фізичним особам, що бажають скористатися послугою і мають технічну можливість одержання послуги.
                </p>
                <h5>1. ТЕРМІНИ ТА ВИЗНАЧЕННЯ</h5>
                <p>
                    1.1. Публічна оферта – пропозиція Виконавця, адресована будь-якій фізичній особі, у відповідності зі статтею 633 Цивільного кодексу України, 
                    укласти з ним публічний договір про надання послуг доступу до сервісу <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a>  для оскарження штрафів за перевищення швидкості.
                </p>
                <p>
                    1.2. Акцепт – повна й безумовна згода Замовника на укладення даного Договору на умовах, визначених даним Договором.
                </p>
                <p>
                    1.3. Виконавець – ТОВ «2х2 Фінанс», код ЕГРПОУ: 38618785 є власником сервісу <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a>
                    та надає послуги визначені даним Договором.
                </p>
                <p>
                    1.4. Замовник – фізична особа, користувач сервісу, яка замовила дані на сайті <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a>
                    та оплатила послуги.
                </p>
                <p>
                    1.5. Послуга – це автоматична генерація адміністративного позову за допомогою сервісу <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a>
                    на підставі внесених даних Замовником на сайті, після здійснення оплати вартості наданих послуг. Надана послуга є оплатною. 
                </p>
                <p>
                    1.6. Вартість Послуги – вартість Послуги встановлюється відповідно до Додатку 1 до цього Договору.
                </p>
                <h5>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h5>
                <p>
                    2.1. На підставі та на умовах визначених цим Договором після здійснення оплати за послугу Виконавець надає Замовнику, 
                    а Замовник приймає автоматично згенерований сайтом адміністративний позов на підставі даних внесених Замовником у систему.
                </p>
                <p>
                    2.2. Послуга надається на платній основі. Вартість послуги встановлюється Додатком 1 до цього Договору.
                </p>
                <p>
                    2.3. Послуга вважається наданою після автоматичної генерації адміністративного позову на сайті <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a>, 
                    або відправлення генерованого адміністративного позову на електронну адресу зазначену Замовником у відповідному розділі сайту. 
                </p>
                <p>
                    2.4. Всі зміни й доповнення до даного Договору опубліковуються на сайті Виконавця.
                </p>
                <p>
                2.5. Всі умови даного Договору є обов'язковими як для Замовника, так і для Виконавця. 
                Перед початком користування Послугою Замовник зобов'язаний ознайомитися з умовами даного Договору. 
                Якщо Замовник не згодний з умовами даного Договору, він не вправі користуватися послугами.
                </p>
                <p>
                2.6. У разі незгоди Замовника зі змінами, внесеними Виконавцем у даний Договір або з новими тарифами на 
                Послугу Замовник повинен припинити користування сервісом. 
                </p>
                <h5>3. ПОРЯДОК НАДАННЯ ПОСЛУГ</h5>
                <p>
                3.1. Надання послуг починається після прийняття Замовником умов даного Договору, без його письмового підписання Сторонами. 
                Дійсний Договір має юридичну силу відповідно до ст. 633 ЦК України і є рівносильним Договору, підписаному Сторонами. 
                Відповідно, Замовник, який ознайомився на сайті вважається ознайомленим з даним Договором та таким, що погоджується з усіма його умовами.
                </p>
                <p>
                3.2. Послуги за даним Договором надаються Замовнику на платній основі.
                </p>
                <h5>4. ПРАВА ТА ОБОВЯЗКИ СТОРІН</h5>
                <p>
                4.1. Виконавець зобов'язується:
                </p>
                <p>
                4.1.1. Надавати Замовнику послуги відповідно до сплаченого об’єму послуг.
                </p>
                <p>
                4.2. Замовник зобов'язується:
                </p>
                <p>
                4.2.1. При користуванні послугами вчасно оплачувати послуги Виконавця в обсязі, порядку і терміни передбачені даним Договором.  
                </p>
                <p>
                4.2.2. Бути уважними під час заповнення даних необхідних для формування позову.
                </p>
                <p>
                4.2.3. Дотримуватися умов даного Договору.
                </p>
                <p>
                4.2.4. Не перепродавати, не надавати результати послуг за даним Договором третім особам. 
                </p>
                <p>
                4.2.5. Ознайомитись з Договором,  дотримуватись та виконувати його вимоги.
                </p>
                <p>
                4.3. Замовник має право:
                </p>
                <p>
                4.3.1. Отримувати інформацію про послуги, тарифи.
                </p>
                <h5>5. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h5>
                <p>
                5.1. За невиконання або неналежне виконання зобов'язань за даним Договором 
                Сторони несуть відповідальність згідно з даним Договором та чинним законодавством України.
                </p>
                <p>
                5.2. Ми не несемо відповідальності у разі постановлення ухвали суду не на Вашу користь.
                </p>
                <p>
                5.3. Сервіс Виконавця <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a> не зберігає інформацію про банківські реквізити Замовника, 
                а отже Виконавець не несе відповідальності за їх розповсюдження.
                </p>
                <h5>6. ВАРТІСТЬ ПОСЛУГ, ПОРЯДОК І ТЕРМІНИ ОПЛАТИ</h5>
                <p>
                6.1. Замовник здійснює оплату Послуги за тарифами, які встановлюються Виконавцем в Додатку 1 до даного Договору. 
                Виконавець залишає за собою право змінювати встановлені тарифи у разі змінення ринкових умов або за інших суттєвих обставин. 
                </p>
                <p>
                6.2. Оплата послуг здійснюється на умовах передплати. В разі не здійснення оплати дана Послуга сайтом не буде надана.
                </p>
                <p>
                6.3. Оплата послуг здійснюється Замовником на сервісі <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a> у відповідному 
                розділі шляхом перерахування коштів на банківський рахунок Виконавця.
                </p>
                <h5>7. УМОВИ ПОВЕРНЕННЯ КОШТІВ</h5>
                <p>
                    Замовник має право вимагати повернення коштів від Виконавця виключно у наступних випадках: 7.1. 
                    Адміністративний позов не було автоматично згенеровано на сайті Виконавця 
                    <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a> або не було відправлено 
                    протягом однієї доби на електронну адресу Замовника вказану під час заповнення відповідної форми сайту.
                </p>
                <p>
                7.2. За для повернення коштів Замовник має звернутися до офісу ТОВ «2х2 Фінанс» та надати наступні документи:
                <ul>
                    <li>документ, що підтверджує особу (паспорт та ідентифікаційний код) Замовника;</li>
                    <li>письмова заява про неналежне надання Послуг зі сторони Виконавця із обов’язковим наданням відповідних доказів;</li>
                    <li>квитанція, що підтверджує оплату послуг Виконавцю.</li>
                </ul>
                </p>
                <p>
                7.3. Всі витрати, пов’язані з поверненням коштів несе Замовник.
                </p>
                <h5>8. ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ</h5>
                <p>
                8.1 Сторони звільняються від відповідальності за невиконання або неналежне виконання своїх зобов’язань у випадку, 
                якщо таке невиконання або неналежне виконання сталося унаслідок дії обставин непереборної сили. 
                Під обставинами непереборної сили розуміються пожежі, землетруси, інші природні явища, стихійні лиха, дії третіх осіб, 
                збої в електропостачанні й у роботі комунікацій, які використовуються для надання послуг, 
                прийняття актів державних органів та інші незалежні від Сторін обставини, 
                що унеможливлюють своєчасне, повне та належне виконання Стороною своїх зобов’язань за даним Договором.  
                </p>
                <h5>9. ТЕРМІН ДІЇ ДОГОВОРУ, ПОРЯДОК ЙОГО ЗМІНИ ТА РОЗІРВАННЯ</h5>
                <p>
                9.1. Даний Договір набирає чинність для Сторін з моменту оплати Замовникои на сайті, 
                вважається укладеним на невизначений строк і діє до припинення його однією зі Сторін або обома Сторонами.
                </p>
                <p>
                9.2. В односторонньому порядку Договір може бути розірваний лише Виконавцем.
                </p>
                <p>
                9.3. Кошти, зараховані до моменту розірвання Договору на банківський рахунок Виконавця, 
                Замовнику не повертаються і не компенсуються.
                </p>
                <p>
                Додаток 1
                <br/>
                до Публічної оферти та публічного договору
                <br/>
                щодо надання послуг доступу до сервісу <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a>
                </p>
                <h5>ТАРИФИ</h5>
                <p>
                    На виконання умов публічного договору щодо надання послуг доступу до сервісу <a href="https://avtoshtraf.com"> https://avtoshtraf.com </a>
                </p>
                <table>
                    <tr>
                        <th>№</th>
                        <th>Назва послуги</th>
                        <th>Кількість користувачів</th>
                        <th>Вартість</th>
                    </tr>
                    <tr>
                        <td>1.</td>
                        <td>Оскарження штрафу (автоматична підготовка адміністративного позову)</td>
                        <td>1</td>
                        <td>50 грн без ПДВ</td>
                    </tr>
                </table>
                <p>* оплата здійснюється в гривнях</p>
            </div>
        )
    };
};
    

export default Offer;