import React from "react";
import "./Offer.scss";

class Offer extends React.Component {
    constructor(props) {
        super(props);
        this.state = {
            show: false,
            showHelp: false,
            name: "",
            tel: "",
        };
    }
    render() {
        return (
            <div className="Offer">
                <h2>ПУБЛІЧНА ОФЕРТА</h2>
                <h4>
                    Договору про використання сервісу <br />
                    <a href="https://avtoshtraf.com">
                        {" "}
                        https://avtoshtraf.com{" "}
                    </a>
                </h4>
                <p className="italic">
                    Вітаємо! <br /> Ми розробили Сервіс, який дозволить
                    оскаржити штраф за перевищення швидкості руху. В даному
                    договорі Ви знайдете умови, на яких надається даний Сервіс,
                    зможете дізнатися його вартість, інформацію про виконавця
                    тощо.
                </p>
                <p>
                    Ми розробили даний договір максимально простим та зрозумілим
                    для Вас, але якщо у Вас виникнуть додаткові питання –
                    напишіть нам на електронну пошту support@avtoshtraf.com.
                </p>
                <ul>
                    <li>
                        <p className="underlined">
                            <b>СТОРОНИ ДОГОВОРУ</b>
                        </p>
                        <ul>
                            <li>
                                <b> ВИКОНАВЕЦЬ:</b> ТОВ «ІННОВАЦІЙНИЙ ЗАХИСТ»,
                                код ЄДРПОУ: 43790907,
                            </li>
                            <li>
                                <b> ЗАМОВНИК:</b> будь-яка фізична особа, яка
                                бажає використати Сервіс.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>СТОРОНИ ДОГОВОРУ</b>
                        </p>
                        <ul>
                            <li>
                                <b>
                                    Договір про використання сервісу (Договір)
                                </b>{" "}
                                – умови, на яких Замовник може скористатися
                                Сервісом та отримати Послугу.
                            </li>
                            <li>
                                <b>Публічна оферта договору</b> – пропозиція
                                Виконавця, адресована будь-якій фізичній особі,
                                у відповідності зі статтею 633 Цивільного
                                кодексу України, ч. 2 ст. 642 Цивільного кодексу
                                України, прийняти умови Договору про
                                використання сервісу та скористатися Сервісом.
                            </li>
                            <li>
                                <b>Акцепт</b> – повна й безумовна згода
                                Замовника з пропозицією (Публічною офертою
                                договору) Виконавця на умовах викладених нижче.
                            </li>
                            <li>
                                <b>Сервіс</b> – результат комп’ютерного
                                програмування у вигляді інтернет-сайту та
                                онлайн-сервісу
                                <a href="https://avtoshtraf.com">
                                    {" "}
                                    https://avtoshtraf.com
                                </a>{" "}
                                , який дозволяє автоматично згенерувати позов до
                                суду та отримати визначену Договором Послугу.
                            </li>
                            <li>
                                <b>Використання сервісу</b> – будь-яка дія,
                                зроблена Замовником на вебсайті
                                <a href="https://avtoshtraf.com">
                                    {" "}
                                    https://avtoshtraf.com
                                </a>{" "}
                                Сервісу.
                            </li>
                            <li>
                                <b>Послуга </b>–використання Сервісу Замовником,
                                шляхом введення необхідної інформації, в
                                результаті чого Сервіс автоматично складає:
                                <ul>
                                    <li>
                                        адміністративний позову для оскарження
                                        штрафу за перевищення швидкості руху та
                                        надає його Замовнику на умовах даного
                                        Договору.
                                    </li>
                                </ul>
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ЗАГАЛЬНІ ПОЛОЖЕННЯ</b>
                        </p>
                        <ul>
                            <li>
                                <b>Предмет договору.</b> Виконавець надає
                                Замовнику Послугу, а Замовник зобов’язується її
                                оплатити на умовах даного Договору.
                            </li>
                            <li>
                                <b>Укладання Договору.</b>
                                <ul>
                                    <li>
                                        <span className="underlined">
                                            {" "}
                                            Пропозиція укласти Договір (Публічна
                                            оферта).
                                        </span>{" "}
                                        Виконавець розміщує на вебсайті
                                        <a href="https://avtoshtraf.com">
                                            {" "}
                                            https://avtoshtraf.com
                                        </a>{" "}
                                        дану Публічну оферту договору та
                                        пропонує не обмеженій кількості
                                        Замовнику прийняти дану Публічну оферту
                                        договору та використати Сервіс та
                                        отримати Послугу.
                                    </li>
                                    <li>
                                        <span className="underlined">
                                            {" "}
                                            Прийняття пропозиції Виконавця
                                            (Акцепт).
                                        </span>{" "}
                                        Замовник приймає умови даного Договору
                                        повністю та надає безумовну з Публічною
                                        офертою договору Виконавця, шляхом
                                        вчинення однієї з наступних дій або
                                        обидві:
                                        <ul>
                                            <li>Використовуючи Сервіс;</li>
                                            <li>Здійснюючи оплату Послуг.</li>
                                        </ul>
                                    </li>
                                    <li>
                                        <span className="underlined">
                                            {" "}
                                            Укладання Договору.
                                        </span>{" "}
                                        Договір про використання Сервісу
                                        вважається укладеним після прийняття
                                        (акцепту) пропозиції Виконавця
                                        (Публічної оферти) Замовником.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                <b>Наслідки укладання Договору.</b> Укладаючи
                                Договір Замовник підтверджує факт ознайомлення
                                та згоди з усіма умовами Договору про
                                використання сервісу в повному обсязі та
                                зобов’язується їх виконувати.
                            </li>
                            <li>
                                <b>Не згода з умовами даного Договору.</b> Якщо
                                Замовник не згодний з умовами Договору він
                                зобов’язаний негайно припинити використання
                                Сервісу та відмовитися від отримання Послуг за
                                Договором.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ПОРЯДОК НАДАННЯ ПОСЛУГ</b>
                        </p>
                        <ul>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Для отримання Послуги Замовник
                                    зобов’язується:
                                </span>{" "}
                                <ul>
                                    <li>
                                        надати Виконавцю необхідну інформацію
                                        для складання адміністративного позову,
                                        шляхом заповнення полів у Сервісі;
                                    </li>
                                    <li>оплатити Послуги.</li>
                                </ul>
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Достовірність введених даних.
                                </span>{" "}
                                Замовник самостійно несе усю відповідальність за
                                введені ним дані у Сервісі та несе
                                відповідальність, що дані є достовірними.
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Оброблення введених даних.
                                </span>{" "}
                                Оброблення введених Замовником даних
                                здійснюється у відповідності до політики
                                конфіденційності, розміщеної за посиланням:
                                <a href="https://avtoshtraf.com/offer">
                                    {" "}
                                    https://avtoshtraf.com/offer
                                </a>{" "}
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Надання Послуг:
                                </span>{" "}
                                <ul>
                                    <li>
                                        Після введення усіх даних у Сервісі та
                                        здійснення оплати Послуг, Виконавець
                                        надає Замовнику, а Замовник приймає
                                        автоматично згенерований Сервісом
                                        адміністративний позов, на підставі
                                        даних внесених Замовником у Сервісі.
                                    </li>
                                    <li>
                                        Послуга вважається наданою Виконавцем та
                                        прийнятою Замовником після автоматичної
                                        генерації адміністративного позову у
                                        Сервісі та надання позову для скачування
                                        Замовнику або відправлення згенерованого
                                        адміністративного позову на електронну
                                        пошту, зазначену Замовником.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                У розуміння п. 26-1підрозділу 2 розділу XX
                                Податкового кодексу використання Сервісу та
                                надання Послуг є операцією з постачання
                                програмної продукції.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ВАРТІСТЬ ПОСЛУГ, ПОРЯДОК І ТЕРМІНИ ОПЛАТИ</b>
                        </p>
                        <ul>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Вартість Послуг складає:
                                </span>{" "}
                                <ul>
                                    <li>
                                        За підготовку адміністративного позову
                                        для оскарження штрафу за перевищення
                                        швидкості руху – 50,00 (п’ятдесят
                                        гривень 00 копійок) без ПДВ.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Зміна вартості Послуг.
                                </span>{" "}
                                Виконавець залишає за собою право змінювати
                                встановлену Вартість Послуг у разі змінення
                                ринкових умов або за інших суттєвих обставин.
                                Інформація про ці зміни відображається у
                                Сервісі.
                            </li>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Оплата Послуг
                                </span>{" "}
                                здійснюється виключно на умовах передплати,
                                шляхом перерахування 100% вартості Послуг, за
                                допомогою захищеного з’єднання платіжної
                                системи, на банківський рахунок Виконавця.
                                Виконавець не має жодного доступу до платіжних
                                даних Замовника.
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>УМОВИ ПОВЕРНЕННЯ КОШТІВ</b>
                        </p>
                        <ul>
                            <li>
                                <span className="underlined">
                                    {" "}
                                    Повернення коштів можливе виключно у
                                    наступних випадках:
                                </span>{" "}
                                <ul>
                                    <li>
                                        Адміністративний позов не було
                                        автоматично згенеровано у Сервісі або не
                                        було відправлено протягом однієї доби на
                                        електронну адресу Замовника вказану під
                                        час заповнення відповідної форми Сайту.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                Для того щоб повернути кошти, Замовник має
                                звернутися до Виконавця на електронну пошту
                                support@avtoshtraf.com та надати наступні
                                документи:
                                <ul>
                                    <li>
                                        заява про неналежне надання Послуг зі
                                        сторони Виконавця, з описом обставин які
                                        склалися та доказів;
                                    </li>
                                    <li>
                                        документ, що підтверджує особу (паспорт
                                        та ідентифікаційний код) Замовника;
                                    </li>
                                    <li>
                                        квитанція, що підтверджує оплату Послуг
                                        Виконавцю.
                                    </li>
                                </ul>
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ВІДМОВА ВІД ГАРАНТІЙ: </b>
                        </p>
                        <ul>
                            <li>
                                Цей Сервіс надається Виконавцем на основі «як
                                є», Виконавець не несе відповідальності, якщо з
                                будь-якої причини вся або будь-яка частина
                                Сервісу недоступна в будь-який час або протягом
                                будь-якого періоду, в тому числі у разі збоїв
                                технічних сервісів на яких побудований Сервіс та
                                сервісів, де він розміщений. Виконавець не несе
                                відповідальності у разі прийняття рішення суду
                                не на користь Замовника.
                            </li>
                            <li>
                                 Виконавець не несе відповідальності:
                                <ul>
                                    <li>
                                        за подальші дії, які необхідно виконати
                                        Замовнику;
                                    </li>
                                    <li>
                                        за подачу Замовником адміністративного
                                        позову до відповідного суду.
                                    </li>
                                </ul>
                            </li>
                            <li>
                                Послуга може бути не актуальною у випадку сплати
                                Замовником штрафу.
                            </li>
                            <li>
                                Виконавець не несе будь-яку відповідальність за
                                ненадання або неналежне надання Послуг Замовнику
                                за умови настання будь-яких обставин, які
                                виникли не з вини Виконавця (а саме – настання
                                обставин, які виникли з вини чи необережності
                                Замовника та / або настання обставин, які
                                виникли з вини чи необережності будь-якої
                                третьої особи (будь-яких третіх осіб) та /або
                                настання форс-мажорних обставин).
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ЗАСТОСОВАНЕ ПРАВО</b>
                        </p>
                        <ul>
                            <li>
                                Цей Договір регулюється і тлумачяться відповідно
                                до законодавства України.   
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ПОРУШЕННЯ УМОВ ДОГОВОРУ ЗАМОВНИКОМ</b>
                        </p>
                        <ul>
                            <li>
                                У разі порушення Замовником положень цього
                                Договору, Виконавець може негайно призупинити
                                використання Сервісу Замовником та призупинити
                                надання Послуг.
                            </li>
                            <li>
                                Виконавець та Замовник намагатимуться домовитись
                                про мирне врегулювання спору у зв’язку з
                                порушенням Замовником положень цього Договору.
                            </li>
                            <li>
                                Якщо в результаті порушення Замовником умов
                                Договору Виконавцю буде завдано збитків, то
                                Виконавець може вимагати справедливого
                                відшкодування.  
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>
                                ТЕРМІН ДІЇ ДОГОВОРУ, ПОРЯДОК ЙОГО ЗМІНИ ТА
                                РОЗІРВАННЯ
                            </b>
                        </p>
                        <ul>
                            <li>
                                Договір набирає чинність з моменту його Акцепту
                                Замовником та діє протягом строку використання
                                Сервісу Замовником та надання Послуг Виконавцем
                                Замовнику.
                            </li>
                            <li>
                                В односторонньому порядку Договір може бути
                                розірваний за ініціативи Виконавця, шляхом
                                повідомлення про це Замовника.
                            </li>
                            <li>
                                Замовник може припинити даний Договір, шляхом
                                припинення використання Сервісу. 
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p className="underlined">
                            <b>ІНШІ УМОВИ ДОГОВОРУ</b>
                        </p>
                        <ul>
                            <li>
                                Кожна Сторона гарантує іншій Стороні, що володіє
                                необхідною дієздатністю, а рівно всіма правами і
                                повноваженнями, необхідними і достатніми для
                                укладання і виконання цього Договору відповідно
                                до його умов.
                            </li>
                            <li>
                                Виконавець може змінювати умови цього Договору,
                                а також ціни на Послуги, в односторонньому
                                порядку, розміщуючи їх у Сервісі. Всі зміни
                                набувають чинності з моменту їх публікації.
                            </li>
                        </ul>
                    </li>
                </ul>
            </div>
        );
    }
}

export default Offer;
