import React from "react";
import "./Policy.scss";

class Policy extends React.Component {
    constructor(props) {
        super(props);
        this.state = {
            show: false,
            showHelp: false,
            name: "",
            tel: "",
        };
    }
    render() {
        return (
            <div className="Policy">
                <h2>ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</h2>
                <h4>
                    сервісу
                    <a href="https://avtoshtraf.com">
                        {" "}
                        https://avtoshtraf.com{" "}
                    </a>
                    <br />
                    __.07.2020
                </h4>
                <p>
                    До моменту початку користування сервісом «Автоштрафи» уважно
                    ознайомтеся з умовами цієї Політики конфіденційності (надалі
                    іменована – <b>Політика</b>).  
                </p>
                <ol>
                    <li>
                        <b>Терміни</b>
                        <ol>
                            <li>
                                Сторони домовилися, що в цій Політиці наступні
                                терміни вживаються в таких значеннях: 
                                <p>
                                    <b>
                                        Сервіс оскарження автоштрафів (Сервіс)
                                    </b>{" "}
                                    - результат комп’ютерного програмування у
                                    вигляді інтернет-сайту та онлайн-сервісу{" "}
                                    <a href="https://avtoshtraf.com">
                                        {" "}
                                        https://avtoshtraf.com{" "}
                                    </a>
                                    , який дозволяє автоматично згенерувати
                                    позов до суду та отримати визначену
                                    договором Послугу, а саме адміністративний
                                    позову для оскарження штрафу за перевищення
                                    швидкості руху та надає його Замовнику на
                                    умовах даного Договору.
                                </p>
                                <p>
                                    <b>Компанія</b> - товариство, що володіє
                                    винятковими правами управління і розвитку
                                    Сервісу. 
                                </p>
                                <p>
                                    <b>Адміністрація</b> - група осіб, які є
                                    співробітниками Сервісу. Адміністрація
                                    уповноважена виконувати будь-які операції з
                                    акаунтами користувачів в рамках цієї
                                    Політики. 
                                </p>
                                <p>
                                    <b>Адміністрація</b> - група осіб, які є
                                    співробітниками Сервісу. Адміністрація
                                    уповноважена виконувати будь-які операції з
                                    акаунтами користувачів в рамках цієї
                                    Політики. 
                                </p>
                                <p>
                                    <b>Користувач</b> - фізична особа, що
                                    зареєстрована на сервісі у визначеному
                                    Компанією порядку. 
                                </p>
                                <p>
                                    <b>Персональні дані</b> - будь-яка
                                    інформація, що стосується Користувача
                                    Сервісу. 
                                </p>
                                <p>
                                    <b>Обробка персональних даних</b>- будь-яка
                                    дія (операція) або сукупність дій
                                    (операцій), що здійснюються з використанням
                                    засобів автоматизації або без використання
                                    таких засобів з персональними даними,
                                    включаючи збір, запис, систематизацію,
                                    накопичення, зберігання, уточнення
                                    (оновлення, зміна), витяг, використання,
                                    передачу (поширення, надання, доступ),
                                    блокування, видалення, знищення персональних
                                    даних. 
                                </p>
                            </li>
                            <li>
                                Ця Політика визначає порядок обробки та захисту
                                інформації про фізичних осіб, що користуються
                                послугами Сервісу, що розташований в мережі
                                Інтернет за посиланням:{" "}
                                <a href="https://avtoshtraf.com">
                                    {" "}
                                    https://avtoshtraf.com
                                </a>
                                .
                            </li>
                            <li>
                                Метою цієї Політики є забезпечення належного
                                захисту інформації про Користувачів, в тому
                                числі їх персональних даних, від
                                несанкціонованого доступу і розголошення.     
                            </li>
                            <li>
                                Сервіс гарантує Користувачеві, що використання
                                персональних даних, наданих при реєстрації на
                                сайті, буде здійснюватися виключно відповідно до
                                чинного законодавства про захист персональних
                                даних. 
                            </li>
                            <li>
                                Ненадання Користувачем згоди на обробку його
                                персональних даних на зазначених вище умовах чи
                                відкликання особою наданої нею згоди,
                                унеможливлює її реєстрацію та подальше
                                використання Сервісу. 
                            </li>
                            <li>
                                Реєструючись, Користувач добровільно
                                погоджується з політикою обробки (збирання,
                                реєстрації, накопичення, зберігання,
                                адаптування, зміни, поновлення, використання,
                                поширення (розповсюдження, реалізацію,
                                передачу), знеособлення, знищення тощо, у тому
                                числі у картотеках та/або з використанням
                                інформаційно-телекомунікаційних
                                (автоматизованих) систем) і захисту персональних
                                даних , з метою персоніфікації фізичної особи як
                                Користувача Сервісу, у тому числі для участі у
                                заходах рекламного характеру, а також даних про
                                операції придбання послуг, здійснених
                                Користувачем Сервісу або іншими уповноваженими
                                ним третіми особами, а також згоду на передачу
                                (поширення) її персональних даних третім особам
                                з метою їх обробки, в тому числі для здійснення
                                персональних комунікацій з Користувачем,
                                передачі та отримання інформації.  
                            </li>
                            <li>
                                Шляхом використання Сервісу Користувач
                                засвідчує, що ознайомлений з умовами цієї
                                Політики, а також підтверджує ознайомлення з
                                правами, які згідно зі ст. 8 Закону України «Про
                                захист персональних даних» та положеннями
                                чинного законодавства надаються йому як
                                суб’єктові персональних даних, а також
                                погоджується з тим, що Компанія як володілець
                                персональних даних не зобов’язана повідомляти
                                Користувача Сервісу про здійснені ним дії з
                                обробки персональних даних Користувача Сервісу
                                відповідно до зазначених у цьому пункті мети і
                                цілей їх обробки.  
                            </li>
                            <li>
                                Персональні дані, які Користувач передає службі
                                підтримки Сервісу при зверненні, будуть
                                використані тільки з метою вирішення
                                поставленого Користувачем питання. Будь-яка
                                особиста інформація, надана Користувачем, не
                                буде збережена або застосована в будь-яких інших
                                цілях, крім вирішення поставленого Користувачем
                                питання. 
                            </li>
                            <li>
                                У разі змін в цій Політиці, Сервіс сповіщає
                                своїх Користувачів на адресу електронної пошти. 
                            </li>
                        </ol>
                    </li>
                    <li>
                        <b>Дані, які ми збираємо про Користувача </b>
                        <ul>
                            <li>Прізвище;</li>
                            <li>ім'я;</li>
                            <li>по-батькові;</li>
                            <li>адреса проживання;</li>
                            <li>ІПН;</li>
                            <li>електронна пошта;</li>
                            <li>номер телефону.</li>
                        </ul>
                        <p>
                            Також для формування позову на сайті Користувач
                            повинен надати інформацію, яка стосується деталей
                            вчинення правопорушення, а саме:
                        </p>
                        <ul>
                            <li>дата та час правопорушення;</li>
                            <li>марка і модель авто;</li>
                            <li>серія та номер постанови;</li>
                            <li>номерний знак авто;</li>
                            <li>
                                область, в якій було складено оскаржуваний
                                протокол;
                            </li>
                            <li>швидкість, з якою рухався автомобіль;</li>
                            <li>
                                швидкість встановлена на вулиці, по якій рухався
                                автомобіль;
                            </li>
                            <li>
                                посада, спеціальне звання та ПІБ особи, яка
                                розглядає справу;
                            </li>
                            <li>місце скоєння правопорушення.</li>
                        </ul>
                    </li>
                    <li>
                        <b>
                            Підстави, на яких  ми використовуємо персональні
                            дані Користувача
                        </b>
                        <p>
                            Ми використовуємо персональні дані Користувача на
                            законних підставах. Тому ми обробляємо їх тільки,
                            якщо:  
                        </p>
                        <ol>
                            <li>
                                Користувачем надано згоду на обробку
                                персональних даних;  
                            </li>
                            <li>
                                обробка персональних даних Користувача повинна
                                бути здійснена нами відповідно до вимог чинного
                                законодавства, рішенням суду або іншого
                                компетентного державного або муніципального
                                органу влади;  
                            </li>
                            <li>
                                персональні дані були зроблені Користувачем
                                загальнодоступними і знаходяться в публічному
                                доступі. 
                            </li>
                        </ol>
                    </li>
                    <li>
                        <b>Використання інформації</b>
                        <p>
                            Ми можемо використовувати інформацію, яку ми
                            отримали про Користувача у спосіб, зазначений у цій
                            Політиці для різних цілей, в тому числі щоб: 
                        </p>
                        <ul>
                            <li>
                                Забезпечувати, підтримувати і покращувати
                                Сервіс; 
                            </li>
                            <li>
                                Забезпечувати і надавати послуги, які Користувач
                                запросив і відправляти йому відповідну
                                інформацію; 
                            </li>
                            <li>
                                Надсилати Користувачеві повідомлення у разі
                                необхідності; 
                            </li>
                            <li>
                                Персоналізувати і поліпшувати надання послуг і
                                забезпечити індивідуальний підхід до
                                Користувача; 
                            </li>
                            <li>
                                Реалізовувати будь-які інші законні цілі, для
                                яких інформація була зібрана. 
                            </li>
                        </ul>
                    </li>
                    <li>
                        <b>Інформація рекламного характеру</b>
                        <p>
                            Користувач погоджується на отримання інформації
                            рекламного характеру щодо роботи Сервісу на адресу
                            електронної пошти. 
                        </p>
                    </li>
                    <li>
                        <b>Як ми захищаємо персональні дані Користувача</b>
                        <p>
                            Ми приймаємо технічні, організаційні і правові
                            заходи або забезпечуємо їх прийняття для захисту
                            персональних даних Користувача від неправомірного
                            або випадкового доступу, збору, зберігання,
                            використання, передачі, блокування або знищення, а
                            також від інших неправомірних дій або випадкових
                            витоків.  
                        </p>
                        Ми забезпечуємо:  
                        <ul>
                            <li>
                                обмеження і регламентацію складу співробітників,
                                що мають доступ до персональних даних;
                            </li>
                            <li>
                                ознайомлення працівників з вимогами чинного
                                законодавства та нормативних документів з
                                обробки та захисту персональних даних;
                            </li>
                            <li>
                                облік і зберігання матеріальних носіїв
                                інформації та їх обігу, що виключає розкрадання,
                                підміну, несанкціоноване копіювання та знищення;
                            </li>
                            <li>
                                визначення загроз безпеки конфіденційності
                                персональних даних при їх обробці, формування на
                                їх основі моделей загроз; 
                            </li>
                            <li>
                                здійснення антивірусного контролю, запобігання
                                впровадження в корпоративну мережу шкідливих
                                програм (програм-вірусів) і програмних закладок;
                            </li>
                            <li>
                                виявлення вторгнень в корпоративну мережу,  що
                                порушують або створюють передумови до порушення
                                встановлених вимог щодо забезпечення безпеки
                                персональних даних;
                            </li>
                            <li>
                                централізоване управління системою захисту
                                персональних даних;
                            </li>
                        </ul>
                    </li>
                    <li>
                        <b>
                            Права Користувача та як ми забезпечуємо їх
                            дотримання 
                        </b>
                        <p>
                            Ми поважаємо права Користувачів, які стосуються
                            персональних даних і максимально сприяємо їх
                            реалізації та захисту.  
                        </p>
                         <p>Користувач Сервісу має право на:</p>
                        <ol>
                            <p>
                                <li>
                                    те, щоб бути проінформованим про джерела
                                    збирання, місцезнаходження своїх
                                    персональних даних, мету їх обробки,
                                    місцезнаходження або місце проживання
                                    (перебування) володільця чи розпорядника
                                    персональних даних або дати відповідне
                                    доручення щодо отримання цієї інформації
                                    уповноваженим ним особам, крім випадків,
                                    встановлених законом; 
                                </li>
                                <li>
                                    отримувати інформацію про умови надання
                                    доступу до персональних даних, зокрема
                                    інформацію про третіх осіб, яким передаються
                                    персональні дані; 
                                </li>
                                <li>на доступ до своїх персональних даних;</li>
                                <li>
                                    отримувати не пізніш як за тридцять
                                    календарних днів з дня надходження запиту,
                                    крім випадків, передбачених законом,
                                    відповідь про те, чи обробляються
                                    персональні дані Користувача, а також
                                    отримувати зміст таких персональних даних; 
                                </li>
                                <li>
                                    пред’являти вмотивовану вимогу володільцю
                                    персональних даних із запереченням проти
                                    обробки своїх персональних даних; 
                                </li>
                                <li>
                                    пред’являти вмотивовану вимогу щодо зміни
                                    або знищення своїх персональних даних
                                    будь-яким володільцем та розпорядником
                                    персональних даних, якщо ці дані
                                    обробляються незаконно чи є недостовірними; 
                                </li>
                                <li>
                                    на захист своїх персональних даних від
                                    незаконної обробки та випадкової втрати,
                                    знищення, пошкодження у зв’язку з умисним
                                    приховуванням, ненаданням чи несвоєчасним їх
                                    наданням, а також на захист від надання
                                    відомостей, що є недостовірними чи ганьблять
                                    честь, гідність та ділову репутацію фізичної
                                    особи; 
                                </li>
                                <li>
                                    звертатися із скаргами на обробку своїх
                                    персональних даних до Уповноваженого або до
                                    суду; 
                                </li>
                                <li>
                                    застосовувати засоби правового захисту в
                                    разі порушення законодавства про захист
                                    персональних даних; 
                                </li>
                                <li>
                                    вносити застереження стосовно обмеження
                                    права на обробку своїх персональних даних
                                    під час надання згоди; 
                                </li>
                                <li>
                                    відкликати згоду на обробку персональних
                                    даних; 
                                </li>
                                <li>
                                    знати механізм автоматичної обробки
                                    персональних даних; 
                                </li>
                            </p>
                        </ol>
                    </li>
                    <li>
                        <b>Зберігання інформації</b>
                        <p>
                            Ми будемо зберігати і використовувати інформацію
                            настільки довго, наскільки необхідно для того, щоб
                            надавати якісні Послуги і до тих пір, доки таке
                            використання  буде визнано нами  доцільним. Для
                            безпеки Користувача ми зберігаємо інформацію,
                            отриману в процесі  користування сайтом у внутрішній
                            базі даних. 
                        </p>
                    </li>
                    <li>
                        <b>Зв’язок</b>
                        <p>
                            Ви можете звернутись з запитаннями щодо цієї
                            Політики або іншими запитаннями щодо захисту
                            персональних даних в будь-який час за допомогою
                            електронної пошти:  [будь ласка, вкажіть електронну
                            адресу]. 
                        </p>
                    </li>
                </ol>
            </div>
        );
    }
}

export default Policy;
